-- phpMyAdmin SQL Dump
-- version 4.2.7.1
-- http://www.phpmyadmin.net
--
-- Host: 127.0.0.1
-- Generation Time: Apr 22, 2016 at 11:25 AM
-- Server version: 5.6.20
-- PHP Version: 5.5.15

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- Database: `cradle`
--

-- --------------------------------------------------------

--
-- Table structure for table `phone`
--

CREATE TABLE IF NOT EXISTS `phone` (
`id` int(11) NOT NULL,
  `phone` varchar(20) NOT NULL,
  `station` varchar(150) NOT NULL,
  `department` varchar(150) NOT NULL,
  `flag` int(1) NOT NULL
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=502 ;

--
-- Dumping data for table `phone`
--

INSERT INTO `phone` (`id`, `phone`, `station`, `department`, `flag`) VALUES
(1, '0', 'โอเปอร์เรเตอร์', 'งานประชาสัมพันธ์', 1),
(2, '70 ', 'โอเปอร์เรเตอร์', 'งานประชาสัมพันธ์', 1),
(3, '0/70 ', 'โอเปอร์เรเตอร์', 'งานประชาสัมพันธ์', 1),
(4, '1234', 'CPR CODE', 'งานประชาสัมพันธ์', 1),
(5, '1235', 'CPR CODE', 'งานประชาสัมพันธ์', 1),
(6, '1234-5', 'ติดต่อเมื่อประกาศใช้แผนอุบัติเหตุ/ภัย(กองอำนวยการ)', 'งานประชาสัมพันธ์', 1),
(7, '2001', 'รับจองห้องพิเศษและติดต่อ-สอบถาม', 'งานประชาสัมพันธ์', 1),
(8, '1235', 'หน.งานประชาสัมพันธ์', 'งานประชาสัมพันธ์', 1),
(9, '2010', 'ศูนย์เปล ', 'งานผู้ป่วยนอก', 1),
(10, '2035', 'ห้องตรวจคุณภาพชีวิต', 'งานผู้ป่วยนอก', 1),
(11, '2012', 'ฉีดยา-ทำแผล (ในห้องเบอร์2)', 'งานผู้ป่วยนอก', 1),
(12, '2013', 'ตรวจศัลยกรรม(ในห้องเบอร์3)', 'งานผู้ป่วยนอก', 1),
(13, '2014', 'ตรวจศัลยกรรม(ในห้องเบอร์3)', 'งานผู้ป่วยนอก', 1),
(14, '2013-4', 'ตรวจศัลยกรรม(ในห้องเบอร์3)', 'งานผู้ป่วยนอก', 1),
(15, '2015', 'ตรวจอายุรกรรม(ในห้องเบอร์6)', 'งานผู้ป่วยนอก', 1),
(16, '2016', 'ตรวจอายุรกรรม(รับใบนัด)', 'งานผู้ป่วยนอก', 1),
(17, '2017', 'หน้าห้องตรวจอายุรกรรม', 'งานผู้ป่วยนอก', 1),
(18, '2018', 'ดูแลรถนั่ง-นอน อายุรกรรม', 'งานผู้ป่วยนอก', 1),
(19, '2019', 'พยาบาลประชาสัมพันธ์', 'งานผู้ป่วยนอก', 1),
(20, '2020', 'ตรวจประกันสังคม', 'งานผู้ป่วยนอก', 1),
(21, '2021', 'ตรวจกุมารฯหน้าห้อง', 'งานผู้ป่วยนอก', 1),
(22, '2022', 'ตรวจกุมารฯในห้อง', 'งานผู้ป่วยนอก', 1),
(23, '2023', 'ตรวจภายใน สูตินรีเวช', 'งานผู้ป่วยนอก', 1),
(24, '2024', 'วางแผนครอบครัว ANC', 'งานผู้ป่วยนอก', 1),
(25, '2025', 'EKG', 'งานผู้ป่วยนอก', 1),
(26, '2031', 'ตรวจสมรรถภาพหัวใจ', 'งานผู้ป่วยนอก', 1),
(27, '2026', 'ตรวจจิตเวช', 'งานผู้ป่วยนอก', 1),
(28, '2027', 'ตรวจจิตเวช', 'งานผู้ป่วยนอก', 1),
(29, '2028', 'ตรวจจิตเวช', 'งานผู้ป่วยนอก', 1),
(30, '2026-8', 'ตรวจจิตเวช', 'งานผู้ป่วยนอก', 1),
(31, '2029', 'ตรวจหู คอ จมูก', 'งานผู้ป่วยนอก', 1),
(32, '2030', 'ตรวจตา', 'งานผู้ป่วยนอก', 1),
(33, '2032', 'ตรวจโรคทั่วไป', 'งานผู้ป่วยนอก', 1),
(34, '2033', 'คลินิกเบาหวาน', 'งานผู้ป่วยนอก', 1),
(35, '1112', 'ศูนย์ข้อมูล(เอดส์)', 'งานผู้ป่วยนอก', 1),
(36, '2034', 'งานป้องกันการติดเชื้อ IC', 'งานผู้ป่วยนอก', 1),
(37, '2045', 'ตรวจกระดูก', 'งานผู้ป่วยนอก', 1),
(38, '1111', 'ให้คำปรึกษา/คลินิกนิรนาม', 'งานผู้ป่วยนอก', 1),
(39, '2060', 'ทันตกรรม ห้องปฏิบัติงาน', 'กลุ่มงานทันตกรรม', 1),
(40, '2061', 'เคาน์เตอร์ติดต่อ', 'กลุ่มงานทันตกรรม', 1),
(41, '3411', 'ผู้ป่วยหนัก(ICU) ชั้น3', 'หอผู้ป่วย', 1),
(42, '3412', 'ผู้ป่วยหนัก(ICU) ชั้น3', 'หอผู้ป่วย', 1),
(43, '3411-2', 'ผู้ป่วยหนัก(ICU) ชั้น3', 'หอผู้ป่วย', 1),
(44, '3413', 'หน.งาน ICU(ห้องประชุม)', 'หอผู้ป่วย', 1),
(45, '3420', 'หน่วยไตเทียม', 'หอผู้ป่วย', 1),
(46, '3427', 'หน่วยไตเทียม', 'หอผู้ป่วย', 1),
(47, '3420/27', 'หน่วยไตเทียม', 'หอผู้ป่วย', 1),
(48, '3426', 'บริจาคอวัยวะ', 'หอผู้ป่วย', 1),
(49, '3425', 'ศูนย์เครื่องมือแพทย์', 'หอผู้ป่วย', 1),
(50, '3011', 'สงฆ์1', 'หอผู้ป่วย', 1),
(51, '3021', 'สงฆ์2', 'หอผู้ป่วย', 1),
(52, '3031', 'สงฆ์3', 'หอผู้ป่วย', 1),
(53, '3041', 'นรีเวชกรรม', 'หอผู้ป่วย', 1),
(54, '3050', 'นรีเวชกรรม', 'หอผู้ป่วย', 1),
(55, '3041/3050', 'นรีเวชกรรม', 'หอผู้ป่วย', 1),
(56, '3051', 'หลังคลอด', 'หอผู้ป่วย', 1),
(57, '3111', 'ฉัตรแก้ว 1 (ศช)', 'หอผู้ป่วย', 1),
(58, '3112', 'ฉัตรแก้ว 1 (ศช)', 'หอผู้ป่วย', 1),
(59, '3111-2', 'ฉัตรแก้ว 1 (ศช)', 'หอผู้ป่วย', 1),
(60, '3113', 'ห้องพักแพทย์ ฉัตรแก้ว1', 'หอผู้ป่วย', 1),
(61, '3120', 'ฉัตรแก้ว 2 (ศญ)', 'หอผู้ป่วย', 1),
(62, '3121', 'ฉัตรแก้ว 2 (ศญ)', 'หอผู้ป่วย', 1),
(63, '3120-21', 'ฉัตรแก้ว 2 (ศญ)', 'หอผู้ป่วย', 1),
(64, '3123', 'ห้องพักแพทย์ ฉัตรแก้ว2', 'หอผู้ป่วย', 1),
(65, '3131', 'ฉัตรแก้ว 3 (ศช)', 'หอผู้ป่วย', 1),
(66, '3132', 'ฉัตรแก้ว 3 (ศช)', 'หอผู้ป่วย', 1),
(67, '3131-2', 'ฉัตรแก้ว 3 (ศช)', 'หอผู้ป่วย', 1),
(68, '3141', 'ฉัตรแก้ว 4 (ศช)', 'หอผู้ป่วย', 1),
(69, '3143', 'ฉัตรแก้ว 4 (ศช)', 'หอผู้ป่วย', 1),
(70, '3141/43', 'ฉัตรแก้ว 4 (ศช)', 'หอผู้ป่วย', 1),
(71, '3151', 'ฉัตรแก้ว 5', 'หอผู้ป่วย', 1),
(72, '3161', 'ฉัตรแก้ว 6', 'หอผู้ป่วย', 1),
(73, '3113', 'ฉัตรแก้ว 6', 'หอผู้ป่วย', 1),
(74, '3161/3113', 'ฉัตรแก้ว 6', 'หอผู้ป่วย', 1),
(75, '3171', 'ฉัตรแก้ว 7', 'หอผู้ป่วย', 1),
(76, '4709', 'บำบัดเคมี', 'หอผู้ป่วย', 1),
(77, '5514', 'ห้องพักเวรตรวจการ', 'หอผู้ป่วย', 1),
(78, '3181', 'ฉัตรแก้ว 8', 'หอผู้ป่วย', 1),
(79, '3211', 'ร่มสุข 1 (อช)', 'หอผู้ป่วย', 1),
(80, '3212', 'ร่มสุข 1 (อช)', 'หอผู้ป่วย', 1),
(81, '3211-2', 'ร่มสุข 1 (อช)', 'หอผู้ป่วย', 1),
(82, '3215', 'ICUร่มสุข', 'หอผู้ป่วย', 1),
(83, '3216', 'ICUร่มสุข', 'หอผู้ป่วย', 1),
(84, '3215-6', 'ICUร่มสุข', 'หอผู้ป่วย', 1),
(85, '3221', 'ร่มสุข 2', 'หอผู้ป่วย', 1),
(86, '3222', 'ร่มสุข 2', 'หอผู้ป่วย', 1),
(87, '3221-2', 'ร่มสุข 2', 'หอผู้ป่วย', 1),
(88, '3224', 'ห้องส่องกล้อง', 'หอผู้ป่วย', 1),
(89, '3231', 'ร่มสุข3 (อญ)', 'หอผู้ป่วย', 1),
(90, '3232', 'ร่มสุข3 (อญ)', 'หอผู้ป่วย', 1),
(91, '3235', 'ร่มสุข3 (อญ)', 'หอผู้ป่วย', 1),
(92, '3231-2/3235', 'ร่มสุข3 (อญ)', 'หอผู้ป่วย', 1),
(93, '3241', 'ร่มสุข 4', 'หอผู้ป่วย', 1),
(94, '3244', 'ห้องประชุม', 'หอผู้ป่วย', 1),
(95, '3251', 'ร่มสุข 5', 'หอผู้ป่วย', 1),
(96, '3310', 'มณีรัตน์ (ห้องคลอด)', 'หอผู้ป่วย', 1),
(97, '3311', 'มณีรัตน์ (ห้องคลอด)', 'หอผู้ป่วย', 1),
(98, '3310-11', 'มณีรัตน์ (ห้องคลอด)', 'หอผู้ป่วย', 1),
(99, '3312', 'คลินิกนมแม่', 'หอผู้ป่วย', 1),
(100, '3320', 'มณีรัตน์ ชั้น2 (เด็ก 2)', 'หอผู้ป่วย', 1),
(101, '3321', 'มณีรัตน์ ชั้น2 (เด็ก 2)', 'หอผู้ป่วย', 1),
(102, '3320-1', 'มณีรัตน์ ชั้น2 (เด็ก 2)', 'หอผู้ป่วย', 1),
(103, '3322', 'ICUเด็ก (เด็ก 3)', 'หอผู้ป่วย', 1),
(104, '3323', 'ICUเด็ก (เด็ก 3)', 'หอผู้ป่วย', 1),
(105, '3322-3', 'ICUเด็ก (เด็ก 3)', 'หอผู้ป่วย', 1),
(106, '3351', 'กรกนก 1', 'หอผู้ป่วย', 1),
(107, '3361', 'กรกนก 2', 'หอผู้ป่วย', 1),
(108, '3330', 'ชนกนาถ ชั้น1', 'หอผู้ป่วย', 1),
(109, '3331', 'ชนกนาถ ชั้น1', 'หอผู้ป่วย', 1),
(110, '3330-31', 'ชนกนาถ ชั้น1', 'หอผู้ป่วย', 1),
(111, '3340', 'ชนกนาถ ชั้น2', 'หอผู้ป่วย', 1),
(112, '3341', 'ชนกนาถ ชั้น2', 'หอผู้ป่วย', 1),
(113, '3340-1', 'ชนกนาถ ชั้น2', 'หอผู้ป่วย', 1),
(114, '3343', 'ห้องพักแพทย์', 'หอผู้ป่วย', 1),
(115, '1669', 'สายด่วน/วิทยุสื่อสาร', 'งานอุบัติเหตุและฉุกเฉิน', 1),
(116, '2094', 'หัวหน้า', 'งานอุบัติเหตุและฉุกเฉิน', 1),
(117, '2041', 'เคาน์เตอร์', 'งานอุบัติเหตุและฉุกเฉิน', 1),
(118, '2043', 'ห้องสังเกตอาการ', 'งานอุบัติเหตุและฉุกเฉิน', 1),
(119, '2044', 'ห้องผ่าตัดเล็ก', 'งานอุบัติเหตุและฉุกเฉิน', 1),
(120, '2046', 'ห้องพักแพทย์', 'งานอุบัติเหตุและฉุกเฉิน', 1),
(121, '2050', 'ศูนย์ประกันสังคม', 'ศูนย์ประกันสุขภาพ', 1),
(122, '2051', 'ศูนย์ประกันสังคม', 'ศูนย์ประกันสุขภาพ', 1),
(123, '2053', 'ศูนย์ประกันสังคม', 'ศูนย์ประกันสุขภาพ', 1),
(124, '2050-1/2053', 'ศูนย์ประกันสังคม', 'ศูนย์ประกันสุขภาพ', 1),
(125, '2052  ', 'งานบริการสัมพันธ์', 'ศูนย์ประกันสุขภาพ', 1),
(126, '2180', 'แพทย์แผนไทย', 'งานแพทย์แผนไทยฯ', 1),
(127, '2181', 'แพทย์แผนไทย', 'งานแพทย์แผนไทยฯ', 1),
(128, '2180-1', 'แพทย์แผนไทย', 'งานแพทย์แผนไทยฯ', 1),
(129, '2073', 'ห้องเซลล์วิทยา', 'กลุ่มงานพยาธิวิทยากายวิภาค', 1),
(130, '2074', 'ตามผลชิ้นเนื้อ', 'กลุ่มงานพยาธิวิทยากายวิภาค', 1),
(131, '1000', 'ผู้อำนวยการ', 'บริหาร', 1),
(132, '1001', 'เลขาฯผู้อำนวยการ', 'บริหาร', 1),
(133, '1002', 'รอง ผอ.ฝ่ายการแพทย์', 'บริหาร', 1),
(134, '1003', 'รอง ผอ.ฝ่ายบริหาร', 'บริหาร', 1),
(135, '1010', 'สำนักงานแพทย์', 'บริหาร', 1),
(136, '1011', 'สำนักงานแพทย์', 'บริหาร', 1),
(137, '1010-1', 'สำนักงานแพทย์', 'บริหาร', 1),
(138, '1012', 'ห้องพักแพทย์', 'บริหาร', 1),
(139, '2246', 'สหกรณ์ รพ.ระยอง', 'บริหาร', 1),
(140, '2247', 'ร้านสวัสดิการ', 'บริหาร', 1),
(141, '2249', 'ร้านสวัสดิการ', 'บริหาร', 1),
(142, '2247/49', 'ร้านสวัสดิการ', 'บริหาร', 1),
(143, '2248', 'ผลิตน้ำของร้านสวัสดิการ', 'บริหาร', 1),
(144, '2300', 'บริหารทั่วไป', 'ฝ่ายบริหารทั่วไป', 1),
(145, '2301', 'บริหารทั่วไป', 'ฝ่ายบริหารทั่วไป', 1),
(146, '2302', 'บริหารทั่วไป', 'ฝ่ายบริหารทั่วไป', 1),
(147, '2300-02', 'บริหารทั่วไป', 'ฝ่ายบริหารทั่วไป', 1),
(148, '2303', 'งานบำบัดน้ำเสีย', 'ฝ่ายบริหารทั่วไป', 1),
(149, '2304', 'ป้อมยามประตูหน้า', 'ฝ่ายบริหารทั่วไป', 1),
(150, '2305', 'ป้อมยามประตูหลัง', 'ฝ่ายบริหารทั่วไป', 1),
(151, '2312', 'ป้อมยามหน้าบ้านพักแพทย์', 'ฝ่ายบริหารทั่วไป', 1),
(152, '2313', 'ป้อมยามในฉัตรแก้ว', 'ฝ่ายบริหารทั่วไป', 1),
(153, '2306', 'ห้องพักศพ', 'ฝ่ายบริหารทั่วไป', 1),
(154, '2307', 'งานสนาม', 'ฝ่ายบริหารทั่วไป', 1),
(155, '2308', 'งานซักฟอก', 'ฝ่ายบริหารทั่วไป', 1),
(156, '2309', 'พนักงานขับรถ', 'ฝ่ายบริหารทั่วไป', 1),
(157, '2243', 'งานห้องสมุด', 'ฝ่ายบริหารทั่วไป', 1),
(158, '2310', 'สนง.การเจ้าหน้าที่', 'ฝ่ายการเจ้าหน้าที่', 1),
(159, '2311', 'สนง.การเจ้าหน้าที่', 'ฝ่ายการเจ้าหน้าที่', 1),
(160, '2310-1', 'สนง.การเจ้าหน้าที่', 'ฝ่ายการเจ้าหน้าที่', 1),
(161, '2340', 'สุขศึกษา', 'กลุ่มงานสุขศึกษา', 1),
(162, '2341', 'สุขศึกษา', 'กลุ่มงานสุขศึกษา', 1),
(163, '2340-1', 'สุขศึกษา', 'กลุ่มงานสุขศึกษา', 1),
(164, '2320', 'หัวหน้าฝ่ายการเงินฯ', 'ฝ่ายการเงินและบัญชี', 1),
(165, '2321', 'สนง.การเงินฯ', 'ฝ่ายการเงินและบัญชี', 1),
(166, '2326', 'เก็บเงินผู้ป่วยใน', 'ฝ่ายการเงินและบัญชี', 1),
(167, '2328', 'เก็บเงินผู้ป่วยนอก', 'ฝ่ายการเงินและบัญชี', 1),
(168, '2141', 'โภชนภิรมย์', 'ฝ่ายโภชนาการ', 1),
(169, '2142', 'โภชนภิรมย์', 'ฝ่ายโภชนาการ', 1),
(170, '2141-2', 'โภชนภิรมย์', 'ฝ่ายโภชนาการ', 1),
(171, '2240', 'สำนักงาน', 'ศูนย์ประสานงานคุณภาพ', 1),
(172, '2243', 'สำนักงาน', 'ศูนย์ประสานงานคุณภาพ', 1),
(173, '2240/43', 'สำนักงาน', 'ศูนย์ประสานงานคุณภาพ', 1),
(174, '1004', 'รอง ผอ.ฝ่ายการพยาบาล', 'กลุ่มการพยาบาล', 1),
(175, '2330', 'ผู้ช่วย หน.พยาบาล', 'กลุ่มการพยาบาล', 1),
(176, '2331', 'ผู้ช่วย หน.พยาบาล', 'กลุ่มการพยาบาล', 1),
(177, '2330-1', 'ผู้ช่วย หน.พยาบาล', 'กลุ่มการพยาบาล', 1),
(178, '2332', 'ธุรการพยาบาล', 'กลุ่มการพยาบาล', 1),
(179, '2170', 'หน่วยจ่ายกลาง', 'กลุ่มการพยาบาล', 1),
(180, '2172', 'โรงนึ่งฆ่าเชื้อ', 'กลุ่มการพยาบาล', 1),
(181, '2070', 'งานโลหิตวิทยา', 'กลุ่มงานพยาธิวิทยาคลินิก', 1),
(182, '2071', 'งานแบคทีเรีย/ธุรการ/หัวหน้า', 'กลุ่มงานพยาธิวิทยาคลินิก', 1),
(183, '2072', 'เคาน์เตอร์/งานเคมีคลินิก', 'กลุ่มงานพยาธิวิทยาคลินิก', 1),
(184, '2078', 'งานภูมิคุ้มกัน', 'กลุ่มงานพยาธิวิทยาคลินิก', 1),
(185, '2079', 'ธนาคารเลือด', 'กลุ่มงานพยาธิวิทยาคลินิก', 1),
(186, '2080', 'ธนาคารเลือด', 'กลุ่มงานพยาธิวิทยาคลินิก', 1),
(187, '2079-80', 'ธนาคารเลือด', 'กลุ่มงานพยาธิวิทยาคลินิก', 1),
(188, '2100', 'หน.ห้องผ่าตัด', 'งานห้องผ่าตัด', 1),
(189, '2101', 'ปชส.เคาน์เตอร์', 'งานห้องผ่าตัด', 1),
(190, '2103', 'หน้าห้องผ่าตัด 3', 'งานห้องผ่าตัด', 1),
(191, '2108', 'ห้องพับผ้า', 'งานห้องผ่าตัด', 1),
(192, '5511', 'ห้องพักเวร จนท.', 'งานห้องผ่าตัด', 1),
(193, '2107', 'วิสัญญี', 'กลุ่มงานวิสัญญีวิทยา', 1),
(194, '5513', 'ห้องพัก จนท', 'กลุ่มงานวิสัญญีวิทยา', 1),
(195, '2120', 'อัลตราซาวด์', 'กลุ่มงานรังสีวิทยา', 1),
(196, '2121', 'เคาน์เตอร์-ลงทะเบียน', 'กลุ่มงานรังสีวิทยา', 1),
(197, '2122', 'CT', 'กลุ่มงานรังสีวิทยา', 1),
(198, '2123', 'รับฟิลม์', 'กลุ่มงานรังสีวิทยา', 1),
(199, '2038', 'งานสังคมสงเคราะห์', 'ฝ่ายสวัสดิการสังคม', 1),
(200, '2039', 'งานสังคมสงเคราะห์', 'ฝ่ายสวัสดิการสังคม', 1),
(201, '2038-9', 'งานสังคมสงเคราะห์', 'ฝ่ายสวัสดิการสังคม', 1),
(202, '2135', 'ชมรมเกาะแก้ว', 'ฝ่ายสวัสดิการสังคม', 1),
(203, '2136', 'ศูนย์ช่วยเหลือเด็กฯ', 'ฝ่ายสวัสดิการสังคม', 1),
(204, '2130', 'หน.เวชกรรมฯ', 'กลุ่มงานเวชกรรมสังคม', 1),
(205, '2129', 'งานควบคุมโรค(ชั้น2)', 'กลุ่มงานเวชกรรมสังคม', 1),
(206, '2131', 'งานควบคุมโรค(ชั้น2)', 'กลุ่มงานเวชกรรมสังคม', 1),
(207, '2129/2131', 'งานควบคุมโรค(ชั้น2)', 'กลุ่มงานเวชกรรมสังคม', 1),
(208, '2132', 'งานส่งเสริม/HHC(ชั้น2)', 'กลุ่มงานเวชกรรมสังคม', 1),
(209, '2133', 'ขอเลขใบ Refer', 'กลุ่มงานเวชกรรมสังคม', 1),
(210, '2137', 'ขอเลขใบ Refer', 'กลุ่มงานเวชกรรมสังคม', 1),
(211, '2133/2137', 'ขอเลขใบ Refer', 'กลุ่มงานเวชกรรมสังคม', 1),
(212, '2040', 'งานระบาด (ชั้น1)', 'กลุ่มงานเวชกรรมสังคม', 1),
(213, '2138', 'ศูนย์30บาท', 'กลุ่มงานเวชกรรมสังคม', 1),
(214, '2139', 'ศูนย์30บาท', 'กลุ่มงานเวชกรรมสังคม', 1),
(215, '2138-9', 'ศูนย์30บาท', 'กลุ่มงานเวชกรรมสังคม', 1),
(216, '2126', 'งานตรวจสุขภาพ', 'กลุ่มงานอาชีวฯ', 1),
(217, '2127', 'ศูนย์พิษวิทยา', 'กลุ่มงานอาชีวฯ', 1),
(218, '2128', 'งานอาชีวอนามัย', 'กลุ่มงานอาชีวฯ', 1),
(219, '2134', 'งานอาชีวอนามัย', 'กลุ่มงานอาชีวฯ', 1),
(220, '0', 'โอเปอร์เรเตอร์', 'งานประชาสัมพันธ์', 1),
(221, '70 ', 'โอเปอร์เรเตอร์', 'งานประชาสัมพันธ์', 1),
(222, '0/70 ', 'โอเปอร์เรเตอร์', 'งานประชาสัมพันธ์', 1),
(223, '1234', 'CPR CODE', 'งานประชาสัมพันธ์', 1),
(224, '1235', 'CPR CODE', 'งานประชาสัมพันธ์', 1),
(225, '1234-5', 'ติดต่อเมื่อประกาศใช้แผนอุบัติเหตุ/ภัย(กองอำนวยการ)', 'งานประชาสัมพันธ์', 1),
(226, '2001', 'รับจองห้องพิเศษและติดต่อ-สอบถาม', 'งานประชาสัมพันธ์', 1),
(227, '1235', 'หน.งานประชาสัมพันธ์', 'งานประชาสัมพันธ์', 1),
(228, '2010', 'ศูนย์เปล ', 'งานผู้ป่วยนอก', 1),
(229, '2035', 'ห้องตรวจคุณภาพชีวิต', 'งานผู้ป่วยนอก', 1),
(230, '2012', 'ฉีดยา-ทำแผล (ในห้องเบอร์2)', 'งานผู้ป่วยนอก', 1),
(231, '2013', 'ตรวจศัลยกรรม(ในห้องเบอร์3)', 'งานผู้ป่วยนอก', 1),
(232, '2014', 'ตรวจศัลยกรรม(ในห้องเบอร์3)', 'งานผู้ป่วยนอก', 1),
(233, '2013-4', 'ตรวจศัลยกรรม(ในห้องเบอร์3)', 'งานผู้ป่วยนอก', 1),
(234, '2015', 'ตรวจอายุรกรรม(ในห้องเบอร์6)', 'งานผู้ป่วยนอก', 1),
(235, '2016', 'ตรวจอายุรกรรม(รับใบนัด)', 'งานผู้ป่วยนอก', 1),
(236, '2017', 'หน้าห้องตรวจอายุรกรรม', 'งานผู้ป่วยนอก', 1),
(237, '2018', 'ดูแลรถนั่ง-นอน อายุรกรรม', 'งานผู้ป่วยนอก', 1),
(238, '2019', 'พยาบาลประชาสัมพันธ์', 'งานผู้ป่วยนอก', 1),
(239, '2020', 'ตรวจประกันสังคม', 'งานผู้ป่วยนอก', 1),
(240, '2021', 'ตรวจกุมารฯหน้าห้อง', 'งานผู้ป่วยนอก', 1),
(241, '2022', 'ตรวจกุมารฯในห้อง', 'งานผู้ป่วยนอก', 1),
(242, '2023', 'ตรวจภายใน สูตินรีเวช', 'งานผู้ป่วยนอก', 1),
(243, '2024', 'วางแผนครอบครัว ANC', 'งานผู้ป่วยนอก', 1),
(244, '2025', 'EKG', 'งานผู้ป่วยนอก', 1),
(245, '2031', 'ตรวจสมรรถภาพหัวใจ', 'งานผู้ป่วยนอก', 1),
(246, '2026', 'ตรวจจิตเวช', 'งานผู้ป่วยนอก', 1),
(247, '2027', 'ตรวจจิตเวช', 'งานผู้ป่วยนอก', 1),
(248, '2028', 'ตรวจจิตเวช', 'งานผู้ป่วยนอก', 1),
(249, '2026-8', 'ตรวจจิตเวช', 'งานผู้ป่วยนอก', 1),
(250, '2029', 'ตรวจหู คอ จมูก', 'งานผู้ป่วยนอก', 1),
(251, '2030', 'ตรวจตา', 'งานผู้ป่วยนอก', 1),
(252, '2032', 'ตรวจโรคทั่วไป', 'งานผู้ป่วยนอก', 1),
(253, '2033', 'คลินิกเบาหวาน', 'งานผู้ป่วยนอก', 1),
(254, '1112', 'ศูนย์ข้อมูล(เอดส์)', 'งานผู้ป่วยนอก', 1),
(255, '2034', 'งานป้องกันการติดเชื้อ IC', 'งานผู้ป่วยนอก', 1),
(256, '2045', 'ตรวจกระดูก', 'งานผู้ป่วยนอก', 1),
(257, '1111', 'ให้คำปรึกษา/คลินิกนิรนาม', 'งานผู้ป่วยนอก', 1),
(258, '2060', 'ทันตกรรม ห้องปฏิบัติงาน', 'กลุ่มงานทันตกรรม', 1),
(259, '2061', 'เคาน์เตอร์ติดต่อ', 'กลุ่มงานทันตกรรม', 1),
(260, '3411', 'ผู้ป่วยหนัก(ICU) ชั้น2', 'หอผู้ป่วย', 1),
(261, '3412', 'ผู้ป่วยหนัก(ICU) ชั้น3', 'หอผู้ป่วย', 1),
(262, '3411-2', 'ผู้ป่วยหนัก(ICU) ชั้น3', 'หอผู้ป่วย', 1),
(263, '3413', 'หน.งาน ICU(ห้องประชุม)', 'หอผู้ป่วย', 1),
(264, '3420', 'หน่วยไตเทียม', 'หอผู้ป่วย', 1),
(265, '3427', 'หน่วยไตเทียม', 'หอผู้ป่วย', 1),
(266, '3420/27', 'หน่วยไตเทียม', 'หอผู้ป่วย', 1),
(267, '3426', 'บริจาคอวัยวะ', 'หอผู้ป่วย', 1),
(268, '3425', 'ศูนย์เครื่องมือแพทย์', 'หอผู้ป่วย', 1),
(269, '3011', 'สงฆ์1', 'หอผู้ป่วย', 1),
(270, '3021', 'สงฆ์2', 'หอผู้ป่วย', 1),
(271, '3031', 'สงฆ์3', 'หอผู้ป่วย', 1),
(272, '3041', 'นรีเวชกรรม', 'หอผู้ป่วย', 1),
(273, '3050', 'นรีเวชกรรม', 'หอผู้ป่วย', 1),
(274, '3041/3050', 'นรีเวชกรรม', 'หอผู้ป่วย', 1),
(275, '3051', 'หลังคลอด', 'หอผู้ป่วย', 1),
(276, '3111', 'ฉัตรแก้ว 1 (ศช)', 'หอผู้ป่วย', 1),
(277, '3112', 'ฉัตรแก้ว 1 (ศช)', 'หอผู้ป่วย', 1),
(278, '3111-2', 'ฉัตรแก้ว 1 (ศช)', 'หอผู้ป่วย', 1),
(279, '3113', 'ห้องพักแพทย์ ฉัตรแก้ว1', 'หอผู้ป่วย', 1),
(280, '3120', 'ฉัตรแก้ว 2 (ศญ)', 'หอผู้ป่วย', 1),
(281, '3121', 'ฉัตรแก้ว 2 (ศญ)', 'หอผู้ป่วย', 1),
(282, '3120-21', 'ฉัตรแก้ว 2 (ศญ)', 'หอผู้ป่วย', 1),
(283, '3123', 'ห้องพักแพทย์ ฉัตรแก้ว2', 'หอผู้ป่วย', 1),
(284, '3131', 'ฉัตรแก้ว 3 (ศช)', 'หอผู้ป่วย', 1),
(285, '3132', 'ฉัตรแก้ว 3 (ศช)', 'หอผู้ป่วย', 1),
(286, '3131-2', 'ฉัตรแก้ว 3 (ศช)', 'หอผู้ป่วย', 1),
(287, '3141', 'ฉัตรแก้ว 4 (ศช)', 'หอผู้ป่วย', 1),
(288, '3143', 'ฉัตรแก้ว 4 (ศช)', 'หอผู้ป่วย', 1),
(289, '3141/43', 'ฉัตรแก้ว 4 (ศช)', 'หอผู้ป่วย', 1),
(290, '3151', 'ฉัตรแก้ว 5', 'หอผู้ป่วย', 1),
(291, '3161', 'ฉัตรแก้ว 6', 'หอผู้ป่วย', 1),
(292, '3113', 'ฉัตรแก้ว 6', 'หอผู้ป่วย', 1),
(293, '3161/3113', 'ฉัตรแก้ว 6', 'หอผู้ป่วย', 1),
(294, '3171', 'ฉัตรแก้ว 7', 'หอผู้ป่วย', 1),
(295, '4709', 'บำบัดเคมี', 'หอผู้ป่วย', 1),
(296, '5514', 'ห้องพักเวรตรวจการ', 'หอผู้ป่วย', 1),
(297, '3181', 'ฉัตรแก้ว 8', 'หอผู้ป่วย', 1),
(298, '3211', 'ร่มสุข 1 (อช)', 'หอผู้ป่วย', 1),
(299, '3212', 'ร่มสุข 1 (อช)', 'หอผู้ป่วย', 1),
(300, '3211-2', 'ร่มสุข 1 (อช)', 'หอผู้ป่วย', 1),
(301, '3215', 'ICUร่มสุข', 'หอผู้ป่วย', 1),
(302, '3216', 'ICUร่มสุข', 'หอผู้ป่วย', 1),
(303, '3215-6', 'ICUร่มสุข', 'หอผู้ป่วย', 1),
(304, '3221', 'ร่มสุข 2', 'หอผู้ป่วย', 1),
(305, '3222', 'ร่มสุข 2', 'หอผู้ป่วย', 1),
(306, '3221-2', 'ร่มสุข 2', 'หอผู้ป่วย', 1),
(307, '3224', 'ห้องส่องกล้อง', 'หอผู้ป่วย', 1),
(308, '3231', 'ร่มสุข3 (อญ)', 'หอผู้ป่วย', 1),
(309, '3232', 'ร่มสุข3 (อญ)', 'หอผู้ป่วย', 1),
(310, '3235', 'ร่มสุข3 (อญ)', 'หอผู้ป่วย', 1),
(311, '3231-2/3235', 'ร่มสุข3 (อญ)', 'หอผู้ป่วย', 1),
(312, '3241', 'ร่มสุข 4', 'หอผู้ป่วย', 1),
(313, '3244', 'ห้องประชุม', 'หอผู้ป่วย', 1),
(314, '3251', 'ร่มสุข 5', 'หอผู้ป่วย', 1),
(315, '3310', 'มณีรัตน์ (ห้องคลอด)', 'หอผู้ป่วย', 1),
(316, '3311', 'มณีรัตน์ (ห้องคลอด)', 'หอผู้ป่วย', 1),
(317, '3310-11', 'มณีรัตน์ (ห้องคลอด)', 'หอผู้ป่วย', 1),
(318, '3312', 'คลินิกนมแม่', 'หอผู้ป่วย', 1),
(319, '3320', 'มณีรัตน์ ชั้น2 (เด็ก 2)', 'หอผู้ป่วย', 1),
(320, '3321', 'มณีรัตน์ ชั้น2 (เด็ก 2)', 'หอผู้ป่วย', 1),
(321, '3320-1', 'มณีรัตน์ ชั้น2 (เด็ก 2)', 'หอผู้ป่วย', 1),
(322, '3322', 'ICUเด็ก (เด็ก 3)', 'หอผู้ป่วย', 1),
(323, '3323', 'ICUเด็ก (เด็ก 3)', 'หอผู้ป่วย', 1),
(324, '3322-3', 'ICUเด็ก (เด็ก 3)', 'หอผู้ป่วย', 1),
(325, '3351', 'กรกนก 1', 'หอผู้ป่วย', 1),
(326, '3361', 'กรกนก 2', 'หอผู้ป่วย', 1),
(327, '3330', 'ชนกนาถ ชั้น1', 'หอผู้ป่วย', 1),
(328, '3331', 'ชนกนาถ ชั้น1', 'หอผู้ป่วย', 1),
(329, '3330-31', 'ชนกนาถ ชั้น1', 'หอผู้ป่วย', 1),
(330, '3340', 'ชนกนาถ ชั้น2', 'หอผู้ป่วย', 1),
(331, '3341', 'ชนกนาถ ชั้น2', 'หอผู้ป่วย', 1),
(332, '3340-1', 'ชนกนาถ ชั้น2', 'หอผู้ป่วย', 1),
(333, '3343', 'ห้องพักแพทย์', 'หอผู้ป่วย', 1),
(334, '1669', 'สายด่วน/วิทยุสื่อสาร', 'งานอุบัติเหตุและฉุกเฉิน', 1),
(335, '2094', 'หัวหน้า', 'งานอุบัติเหตุและฉุกเฉิน', 1),
(336, '2041', 'เคาน์เตอร์', 'งานอุบัติเหตุและฉุกเฉิน', 1),
(337, '2043', 'ห้องสังเกตอาการ', 'งานอุบัติเหตุและฉุกเฉิน', 1),
(338, '2044', 'ห้องผ่าตัดเล็ก', 'งานอุบัติเหตุและฉุกเฉิน', 1),
(339, '2046', 'ห้องพักแพทย์', 'งานอุบัติเหตุและฉุกเฉิน', 1),
(340, '2050', 'ศูนย์ประกันสังคม', 'ศูนย์ประกันสุขภาพ', 1),
(341, '2051', 'ศูนย์ประกันสังคม', 'ศูนย์ประกันสุขภาพ', 1),
(342, '2053', 'ศูนย์ประกันสังคม', 'ศูนย์ประกันสุขภาพ', 1),
(343, '2050-1/2053', 'ศูนย์ประกันสังคม', 'ศูนย์ประกันสุขภาพ', 1),
(344, '2052  ', 'งานบริการสัมพันธ์', 'ศูนย์ประกันสุขภาพ', 1),
(345, '2180', 'แพทย์แผนไทย', 'งานแพทย์แผนไทยฯ', 1),
(346, '2181', 'แพทย์แผนไทย', 'งานแพทย์แผนไทยฯ', 1),
(347, '2180-1', 'แพทย์แผนไทย', 'งานแพทย์แผนไทยฯ', 1),
(348, '2073', 'ห้องเซลล์วิทยา', 'กลุ่มงานพยาธิวิทยากายวิภาค', 1),
(349, '2074', 'ตามผลชิ้นเนื้อ', 'กลุ่มงานพยาธิวิทยากายวิภาค', 1),
(350, '1000', 'ผู้อำนวยการ', 'บริหาร', 1),
(351, '1001', 'เลขาฯผู้อำนวยการ', 'บริหาร', 1),
(352, '1002', 'รอง ผอ.ฝ่ายการแพทย์', 'บริหาร', 1),
(353, '1003', 'รอง ผอ.ฝ่ายบริหาร', 'บริหาร', 1),
(354, '1010', 'สำนักงานแพทย์', 'บริหาร', 1),
(355, '1011', 'สำนักงานแพทย์', 'บริหาร', 1),
(356, '1010-1', 'สำนักงานแพทย์', 'บริหาร', 1),
(357, '1012', 'ห้องพักแพทย์', 'บริหาร', 1),
(358, '2246', 'สหกรณ์ รพ.ระยอง', 'บริหาร', 1),
(359, '2247', 'ร้านสวัสดิการ', 'บริหาร', 1),
(360, '2249', 'ร้านสวัสดิการ', 'บริหาร', 1),
(361, '2247/49', 'ร้านสวัสดิการ', 'บริหาร', 1),
(362, '2248', 'ผลิตน้ำของร้านสวัสดิการ', 'บริหาร', 1),
(363, '2300', 'บริหารทั่วไป', 'ฝ่ายบริหารทั่วไป', 1),
(364, '2301', 'บริหารทั่วไป', 'ฝ่ายบริหารทั่วไป', 1),
(365, '2302', 'บริหารทั่วไป', 'ฝ่ายบริหารทั่วไป', 1),
(366, '2300-02', 'บริหารทั่วไป', 'ฝ่ายบริหารทั่วไป', 1),
(367, '2303', 'งานบำบัดน้ำเสีย', 'ฝ่ายบริหารทั่วไป', 1),
(368, '2304', 'ป้อมยามประตูหน้า', 'ฝ่ายบริหารทั่วไป', 1),
(369, '2305', 'ป้อมยามประตูหลัง', 'ฝ่ายบริหารทั่วไป', 1),
(370, '2312', 'ป้อมยามหน้าบ้านพักแพทย์', 'ฝ่ายบริหารทั่วไป', 1),
(371, '2313', 'ป้อมยามในฉัตรแก้ว', 'ฝ่ายบริหารทั่วไป', 1),
(372, '2306', 'ห้องพักศพ', 'ฝ่ายบริหารทั่วไป', 1),
(373, '2307', 'งานสนาม', 'ฝ่ายบริหารทั่วไป', 1),
(374, '2308', 'งานซักฟอก', 'ฝ่ายบริหารทั่วไป', 1),
(375, '2309', 'พนักงานขับรถ', 'ฝ่ายบริหารทั่วไป', 1),
(376, '2243', 'งานห้องสมุด', 'ฝ่ายบริหารทั่วไป', 1),
(377, '2310', 'สนง.การเจ้าหน้าที่', 'ฝ่ายการเจ้าหน้าที่', 1),
(378, '2311', 'สนง.การเจ้าหน้าที่', 'ฝ่ายการเจ้าหน้าที่', 1),
(379, '2310-1', 'สนง.การเจ้าหน้าที่', 'ฝ่ายการเจ้าหน้าที่', 1),
(380, '2340', 'สุขศึกษา', 'กลุ่มงานสุขศึกษา', 1),
(381, '2341', 'สุขศึกษา', 'กลุ่มงานสุขศึกษา', 1),
(382, '2340-1', 'สุขศึกษา', 'กลุ่มงานสุขศึกษา', 1),
(383, '2320', 'หัวหน้าฝ่ายการเงินฯ', 'ฝ่ายการเงินและบัญชี', 1),
(384, '2321', 'สนง.การเงินฯ', 'ฝ่ายการเงินและบัญชี', 1),
(385, '2326', 'เก็บเงินผู้ป่วยใน', 'ฝ่ายการเงินและบัญชี', 1),
(386, '2328', 'เก็บเงินผู้ป่วยนอก', 'ฝ่ายการเงินและบัญชี', 1),
(387, '2141', 'โภชนภิรมย์', 'ฝ่ายโภชนาการ', 1),
(388, '2142', 'โภชนภิรมย์', 'ฝ่ายโภชนาการ', 1),
(389, '2141-2', 'โภชนภิรมย์', 'ฝ่ายโภชนาการ', 1),
(390, '2240', 'สำนักงาน', 'ศูนย์ประสานงานคุณภาพ', 1),
(391, '2243', 'สำนักงาน', 'ศูนย์ประสานงานคุณภาพ', 1),
(392, '2240/43', 'สำนักงาน', 'ศูนย์ประสานงานคุณภาพ', 1),
(393, '1004', 'รอง ผอ.ฝ่ายการพยาบาล', 'กลุ่มการพยาบาล', 1),
(394, '2330', 'ผู้ช่วย หน.พยาบาล', 'กลุ่มการพยาบาล', 1),
(395, '2331', 'ผู้ช่วย หน.พยาบาล', 'กลุ่มการพยาบาล', 1),
(396, '2330-1', 'ผู้ช่วย หน.พยาบาล', 'กลุ่มการพยาบาล', 1),
(397, '2332', 'ธุรการพยาบาล', 'กลุ่มการพยาบาล', 1),
(398, '2170', 'หน่วยจ่ายกลาง', 'กลุ่มการพยาบาล', 1),
(399, '2172', 'โรงนึ่งฆ่าเชื้อ', 'กลุ่มการพยาบาล', 1),
(400, '2070', 'งานโลหิตวิทยา', 'กลุ่มงานพยาธิวิทยาคลินิก', 1),
(401, '2071', 'งานแบคทีเรีย/ธุรการ/หัวหน้า', 'กลุ่มงานพยาธิวิทยาคลินิก', 1),
(402, '2072', 'เคาน์เตอร์/งานเคมีคลินิก', 'กลุ่มงานพยาธิวิทยาคลินิก', 1),
(403, '2078', 'งานภูมิคุ้มกัน', 'กลุ่มงานพยาธิวิทยาคลินิก', 1),
(404, '2079', 'ธนาคารเลือด', 'กลุ่มงานพยาธิวิทยาคลินิก', 1),
(405, '2080', 'ธนาคารเลือด', 'กลุ่มงานพยาธิวิทยาคลินิก', 1),
(406, '2079-80', 'ธนาคารเลือด', 'กลุ่มงานพยาธิวิทยาคลินิก', 1),
(407, '2100', 'หน.ห้องผ่าตัด', 'งานห้องผ่าตัด', 1),
(408, '2101', 'ปชส.เคาน์เตอร์', 'งานห้องผ่าตัด', 1),
(409, '2103', 'หน้าห้องผ่าตัด 3', 'งานห้องผ่าตัด', 1),
(410, '2108', 'ห้องพับผ้า', 'งานห้องผ่าตัด', 1),
(411, '5511', 'ห้องพักเวร จนท.', 'งานห้องผ่าตัด', 1),
(412, '2107', 'วิสัญญี', 'กลุ่มงานวิสัญญีวิทยา', 1),
(413, '5513', 'ห้องพัก จนท', 'กลุ่มงานวิสัญญีวิทยา', 1),
(414, '2120', 'อัลตราซาวด์', 'กลุ่มงานรังสีวิทยา', 1),
(415, '2121', 'เคาน์เตอร์-ลงทะเบียน', 'กลุ่มงานรังสีวิทยา', 1),
(416, '2122', 'CT', 'กลุ่มงานรังสีวิทยา', 1),
(417, '2123', 'รับฟิลม์', 'กลุ่มงานรังสีวิทยา', 1),
(418, '2038', 'งานสังคมสงเคราะห์', 'ฝ่ายสวัสดิการสังคม', 1),
(419, '2039', 'งานสังคมสงเคราะห์', 'ฝ่ายสวัสดิการสังคม', 1),
(420, '2038-9', 'งานสังคมสงเคราะห์', 'ฝ่ายสวัสดิการสังคม', 1),
(421, '2135', 'ชมรมเกาะแก้ว', 'ฝ่ายสวัสดิการสังคม', 1),
(422, '2136', 'ศูนย์ช่วยเหลือเด็กฯ', 'ฝ่ายสวัสดิการสังคม', 1),
(423, '2130', 'หน.เวชกรรมฯ', 'กลุ่มงานเวชกรรมสังคม', 1),
(424, '2129', 'งานควบคุมโรค(ชั้น2)', 'กลุ่มงานเวชกรรมสังคม', 1),
(425, '2131', 'งานควบคุมโรค(ชั้น2)', 'กลุ่มงานเวชกรรมสังคม', 1),
(426, '2129/2131', 'งานควบคุมโรค(ชั้น2)', 'กลุ่มงานเวชกรรมสังคม', 1),
(427, '2132', 'งานส่งเสริม/HHC(ชั้น2)', 'กลุ่มงานเวชกรรมสังคม', 1),
(428, '2133', 'ขอเลขใบ Refer', 'กลุ่มงานเวชกรรมสังคม', 1),
(429, '2137', 'ขอเลขใบ Refer', 'กลุ่มงานเวชกรรมสังคม', 1),
(430, '2133/2137', 'ขอเลขใบ Refer', 'กลุ่มงานเวชกรรมสังคม', 1),
(431, '2040', 'งานระบาด (ชั้น1)', 'กลุ่มงานเวชกรรมสังคม', 1),
(432, '2138', 'ศูนย์30บาท', 'กลุ่มงานเวชกรรมสังคม', 1),
(433, '2139', 'ศูนย์30บาท', 'กลุ่มงานเวชกรรมสังคม', 1),
(434, '2138-9', 'ศูนย์30บาท', 'กลุ่มงานเวชกรรมสังคม', 1),
(435, '2126', 'งานตรวจสุขภาพ', 'กลุ่มงานอาชีวฯ', 1),
(436, '2127', 'ศูนย์พิษวิทยา', 'กลุ่มงานอาชีวฯ', 1),
(437, '2128', 'งานอาชีวอนามัย', 'กลุ่มงานอาชีวฯ', 1),
(438, '2134', 'งานอาชีวอนามัย', 'กลุ่มงานอาชีวฯ', 1),
(439, '"2128,2134"', 'งานอาชีวอนามัย', 'กลุ่มงานอาชีวฯ', 1),
(440, '2145', 'คลินิกอาชีวฯ', 'กลุ่มงานอาชีวฯ', 1),
(441, '3333', 'ตรวจสุขภาพต่างด้าว', 'กลุ่มงานอาชีวฯ', 1),
(442, '2210', 'เวชระเบียนผู้ป่วยนอก', 'ฝ่ายแผนงานและสารสนเทศ', 1),
(443, '2211', 'เวชระเบียนผู้ป่วยนอก', 'ฝ่ายแผนงานและสารสนเทศ', 1),
(444, '2212', 'เวชระเบียนผู้ป่วยนอก', 'ฝ่ายแผนงานและสารสนเทศ', 1),
(445, '2210-2', 'เวชระเบียนผู้ป่วยนอก', 'ฝ่ายแผนงานและสารสนเทศ', 1),
(446, '2213', 'เคมของบัตรทอง (ชั้น4)', 'ฝ่ายแผนงานและสารสนเทศ', 1),
(447, '2241', 'ศูนย์ข้อมูลข่าวสาร', 'ฝ่ายแผนงานและสารสนเทศ', 1),
(448, '2242', 'ศูนย์คอมพิวเตอร์', 'ฝ่ายแผนงานและสารสนเทศ', 1),
(449, '2245', 'เวชระเบียนผู้ป่วยใน (สถิติ)', 'ฝ่ายแผนงานและสารสนเทศ', 1),
(450, '2150', 'หน.เภสัชกรรม', 'กลุ่มงานเภสัชกรรม', 1),
(451, '2151', 'บริหารเวชภัณฑ์', 'กลุ่มงานเภสัชกรรม', 1),
(452, '2167', 'จัดซื้อ', 'กลุ่มงานเภสัชกรรม', 1),
(453, '2152', 'เภสัชสนเทศ', 'กลุ่มงานเภสัชกรรม', 1),
(454, '2153', 'จ่ายยาผู้ป่วยนอก ชั้น1', 'กลุ่มงานเภสัชกรรม', 1),
(455, '2165', 'จ่ายยาผู้ป่วยนอก ชั้น1', 'กลุ่มงานเภสัชกรรม', 1),
(456, '2153/2165', 'จ่ายยาผู้ป่วยนอก ชั้น1', 'กลุ่มงานเภสัชกรรม', 1),
(457, '2154', 'จ่ายยาผู้ป่วยนอก ชั้น2', 'กลุ่มงานเภสัชกรรม', 1),
(458, '2155', 'จ่ายยาผู้ป่วยใน', 'กลุ่มงานเภสัชกรรม', 1),
(459, '2160', 'จ่ายยาผู้ป่วยใน', 'กลุ่มงานเภสัชกรรม', 1),
(460, '2155/2160', 'จ่ายยาผู้ป่วยใน', 'กลุ่มงานเภสัชกรรม', 1),
(461, '2156', 'ผลิตยาทั่วไป', 'กลุ่มงานเภสัชกรรม', 1),
(462, '2166', 'ผลิตยาทั่วไป', 'กลุ่มงานเภสัชกรรม', 1),
(463, '2156/2166', 'ผลิตยาทั่วไป', 'กลุ่มงานเภสัชกรรม', 1),
(464, '2157', 'คลังยา อาคารเภสัช', 'กลุ่มงานเภสัชกรรม', 1),
(465, '2158', 'ห้องเตรียมยาเคมีบำบัด', 'กลุ่มงานเภสัชกรรม', 1),
(466, '2159', 'คลังยา ตึกอำนวยการ', 'กลุ่มงานเภสัชกรรม', 1),
(467, '3344', 'พัฒนาการเด็ก ชั้น4', 'พัฒนาการเด็ก', 1),
(468, '2334', 'ศูนย์รับเลี้ยงเด็ก (เดแคร์)', 'พัฒนาการเด็ก', 1),
(469, '5524', 'แม่บ้าน บ้านพักแพทย์', 'พัฒนาการเด็ก', 1),
(470, '5525', 'แม่บ้าน บ้านพักแพทย์', 'พัฒนาการเด็ก', 1),
(471, '5524-5', 'แม่บ้าน บ้านพักแพทย์', 'พัฒนาการเด็ก', 1);
INSERT INTO `phone` (`id`, `phone`, `station`, `department`, `flag`) VALUES
(472, '2110', 'หน.กลุ่มงานฯ', 'กลุ่มงานเวชกรรมฟื้นฟู', 1),
(473, '2111', 'เคาน์เตอร์', 'กลุ่มงานเวชกรรมฟื้นฟู', 1),
(474, '2112', 'กายภาพบำบัดชั้น 2', 'กลุ่มงานเวชกรรมฟื้นฟู', 1),
(475, '2113', 'ห้องฟิตเนส', 'กลุ่มงานเวชกรรมฟื้นฟู', 1),
(476, '2114', 'กายอุปกรณ์', 'กลุ่มงานเวชกรรมฟื้นฟู', 1),
(477, '2250', 'พรส.', 'กลุ่มงานพัฒนาระบบบริการสุขภาพ', 1),
(478, '2251', 'พรส.', 'กลุ่มงานพัฒนาระบบบริการสุขภาพ', 1),
(479, '2250-1', 'พรส.', 'กลุ่มงานพัฒนาระบบบริการสุขภาพ', 1),
(480, '2253', 'งานโสตทัศนูปกรณ์', 'กลุ่มงานพัฒนาระบบบริการสุขภาพ', 1),
(481, '2255', 'งานโสตทัศนูปกรณ์', 'กลุ่มงานพัฒนาระบบบริการสุขภาพ', 1),
(482, '2253/2255', 'งานโสตทัศนูปกรณ์', 'กลุ่มงานพัฒนาระบบบริการสุขภาพ', 1),
(483, '2254', 'ห้องควบคุมเสียง', 'กลุ่มงานพัฒนาระบบบริการสุขภาพ', 1),
(484, '2256', 'ภูวเนตร 1', 'กลุ่มงานพัฒนาระบบบริการสุขภาพ', 1),
(485, '2257', 'ภูวเนตร 2', 'กลุ่มงานพัฒนาระบบบริการสุขภาพ', 1),
(486, '2412', 'หน.พัสดุฯ', 'ฝ่ายพัสดุฯ', 1),
(487, '2410', 'สนงพัสดุฯ', 'ฝ่ายพัสดุฯ', 1),
(488, '2411', 'สนงพัสดุฯ', 'ฝ่ายพัสดุฯ', 1),
(489, '2410-1', 'สนงพัสดุฯ', 'ฝ่ายพัสดุฯ', 1),
(490, '2414', 'จ่ายของชั้น 2', 'ฝ่ายพัสดุฯ', 1),
(491, '2415', 'ตัดเย็บ', 'ฝ่ายพัสดุฯ', 1),
(492, '2421', 'อิเล็กทรอนิกส์/ไฟฟ้า', 'ฝ่ายพัสดุฯ', 1),
(493, '2422', 'ช่างแอร์', 'ฝ่ายพัสดุฯ', 1),
(494, '2423', 'เครื่องมือพ./ช่างไม้-ประปา/เวรช่าง', 'ฝ่ายพัสดุฯ', 1),
(495, '2424', 'สโตร์ช่าง', 'ฝ่ายพัสดุฯ', 1),
(496, '2425', 'สโตร์ช่าง', 'ฝ่ายพัสดุฯ', 1),
(497, '2424-25', 'สโตร์ช่าง', 'ฝ่ายพัสดุฯ', 1),
(498, '2222', 'ห้องปฏิบัติการระบบโทรศัพท์และคอมพิวเตอร์', 'ฝ่ายพัสดุฯ', 1),
(499, '1020', 'สำนักงาน', 'ศูนย์สันติสุข', 1),
(500, '1021', 'สำนักงาน', 'ศูนย์สันติสุข', 1),
(501, '1020-1', 'สำนักงาน', 'ศูนย์สันติสุข', 1);

-- --------------------------------------------------------

--
-- Table structure for table `service`
--

CREATE TABLE IF NOT EXISTS `service` (
`id` int(11) NOT NULL,
  `start_date` date NOT NULL,
  `start_time` time NOT NULL,
  `user_name` varchar(150) NOT NULL,
  `phone` varchar(20) NOT NULL,
  `station` varchar(150) NOT NULL,
  `department` varchar(150) NOT NULL,
  `user_content` text NOT NULL,
  `staff_name` varchar(150) NOT NULL,
  `staff_content` text NOT NULL,
  `end_date` date NOT NULL,
  `end_time` time NOT NULL,
  `status` varchar(20) NOT NULL,
  `flag` int(1) NOT NULL
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=13 ;

--
-- Dumping data for table `service`
--

INSERT INTO `service` (`id`, `start_date`, `start_time`, `user_name`, `phone`, `station`, `department`, `user_content`, `staff_name`, `staff_content`, `end_date`, `end_time`, `status`, `flag`) VALUES
(1, '2016-04-22', '00:27:58', '', '', '', '', '', '', '', '0000-00-00', '00:00:00', 'รอดำเนินการ', 1),
(2, '2016-04-22', '00:29:30', '', '', '', '', '', '', '', '0000-00-00', '00:00:00', 'รอดำเนินการ', 1),
(3, '2016-04-22', '00:36:56', '', '', '', '', '', '', '', '0000-00-00', '00:00:00', 'รอดำเนินการ', 1),
(4, '2016-04-22', '00:38:42', '', '', '', '', '', '', '', '0000-00-00', '00:00:00', 'รอดำเนินการ', 1),
(5, '2016-04-22', '00:39:45', '', '', '', '', '', '', '', '0000-00-00', '00:00:00', 'รอดำเนินการ', 1),
(6, '2016-04-22', '00:41:58', '', '', '', '', '', '', '', '0000-00-00', '00:00:00', 'รอดำเนินการ', 1),
(7, '2016-04-22', '00:44:10', 'fgdfg', 'dfg', 'dfgdf', 'gfdgfd', 'gdfgdf', '', '', '0000-00-00', '00:00:00', 'รอดำเนินการ', 1),
(8, '2016-04-22', '00:45:06', 'กหดหดก', 'ดกด', 'กหดก', 'ดกห', 'ดกหด', 'ศูนย์เปล', '', '0000-00-00', '00:00:00', 'รอดำเนินการ', 1),
(9, '2016-04-22', '01:00:11', '999', '99', '99', '99', '99', 'ศูนย์เปล', '', '0000-00-00', '00:00:00', 'รอดำเนินการ', 1),
(10, '2016-04-22', '10:07:34', 'som', '2222', 'ชนกนาถ', 'หอผู้ป่วย', 'ทดสอบ', 'ศูนย์เปล', '', '0000-00-00', '00:00:00', 'รอดำเนินการ', 0),
(11, '2016-04-22', '10:08:16', 'กดเ', 'ดกเ', 'กดเ', 'กดเ', 'กดเกดกดกดดกดกดดกดดกดดกดกดกกดกดกรนนรนรนรนรนรนร', 'ศูนย์เปล', '', '0000-00-00', '00:00:00', 'รอดำเนินการ', 0),
(12, '2016-04-22', '15:15:37', 'rtewtr', '2242', 'ศูนย์คอมพิวเตอร์', 'ฝ่ายแผนงานและสารสนเทศ', 'mmghk', 'ศูนย์เปล', '', '0000-00-00', '00:00:00', 'รอดำเนินการ', 1);

-- --------------------------------------------------------

--
-- Table structure for table `staff`
--

CREATE TABLE IF NOT EXISTS `staff` (
`id` int(11) NOT NULL,
  `username` varchar(50) NOT NULL,
  `password` varchar(50) NOT NULL,
  `titlename` varchar(10) NOT NULL,
  `firstname` varchar(100) NOT NULL,
  `lastname` varchar(100) NOT NULL,
  `position` varchar(50) NOT NULL,
  `phone` varchar(20) NOT NULL,
  `station` varchar(150) NOT NULL,
  `department` varchar(150) NOT NULL,
  `role` int(1) NOT NULL,
  `flag` int(1) NOT NULL
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=2 ;

--
-- Dumping data for table `staff`
--

INSERT INTO `staff` (`id`, `username`, `password`, `titlename`, `firstname`, `lastname`, `position`, `phone`, `station`, `department`, `role`, `flag`) VALUES
(1, 'witoon', '1234', 'นาย', 'witoon', 'phongprasert', 'computer', '2242', 'ศูนย์คอมพิวเตอร์', 'ระบบบริการทางการแพทย์และเทคโนโลยีสาารสนเทศ', 1, 1);

-- --------------------------------------------------------

--
-- Table structure for table `user`
--

CREATE TABLE IF NOT EXISTS `user` (
`id` int(11) NOT NULL,
  `username` varchar(50) NOT NULL,
  `password` varchar(50) NOT NULL,
  `titlename` varchar(10) NOT NULL,
  `firstname` varchar(100) NOT NULL,
  `lastname` varchar(100) NOT NULL,
  `phone` varchar(20) NOT NULL,
  `station` varchar(150) NOT NULL,
  `department` varchar(150) NOT NULL,
  `flag` int(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 AUTO_INCREMENT=1 ;

--
-- Indexes for dumped tables
--

--
-- Indexes for table `phone`
--
ALTER TABLE `phone`
 ADD PRIMARY KEY (`id`);

--
-- Indexes for table `service`
--
ALTER TABLE `service`
 ADD PRIMARY KEY (`id`);

--
-- Indexes for table `staff`
--
ALTER TABLE `staff`
 ADD PRIMARY KEY (`id`);

--
-- Indexes for table `user`
--
ALTER TABLE `user`
 ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `phone`
--
ALTER TABLE `phone`
MODIFY `id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=502;
--
-- AUTO_INCREMENT for table `service`
--
ALTER TABLE `service`
MODIFY `id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=13;
--
-- AUTO_INCREMENT for table `staff`
--
ALTER TABLE `staff`
MODIFY `id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=2;
--
-- AUTO_INCREMENT for table `user`
--
ALTER TABLE `user`
MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
